cases/artigo_mestrado/old/fsi-flap/fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       7440;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       7480;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       7520;
    }
    interface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       7620;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          90;
        startFace       7670;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          7600;
        startFace       7760;
    }
)

// ************************************************************************* //
