cases/artigo_mestrado/old/fsi-flap/fluid/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    // Regex covers both predictor (U) and corrector (UFinal) — required in v2512
    "(U|UFinal)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }

    // cellDisplacement is the intermediate field used by displacementLaplacian
    cellDisplacement
    {
        solver          GAMG;
        tolerance       1e-05;
        relTol          0;
        smoother        GaussSeidel;
    }

    cellDisplacementFinal
    {
        $cellDisplacement;
    }

    // pcorr is used during mesh motion to correct pressure after mesh update
    pcorr
    {
        $p;
        relTol          0;
    }

    pcorrFinal
    {
        $pcorr;
    }
}

PIMPLE
{
    nOuterCorrectors        3;
    nCorrectors             2;
    nNonOrthogonalCorrectors 1;
    pRefCell                0;
    pRefValue               0;
}
